//串口读取

//******************************逻辑******************************//
  /*启用串口后，会自动读取引脚状态
  /*print打印函数，后+ln用于换行
//******************************全局部分******************************//
int key=11;
int serialnum;

//******************************初始化******************************//
void setup()
{
  pinMode(11,INPUT_PULLUP);
  Serial.begin(9600);
}

//******************************内层函数******************************//
void serialread()
{
  serialnum=digitalRead(key);
  Serial.print("当前状态为：");
  Serial.println(serialnum);
}

//******************************主函数******************************//
void loop()
{
  serialread();
  delay(20);
}
