//长按开启led程序

//******************************逻辑******************************// 
    /*   单变量state控制只能长按来保证led亮起
    /*   if函数配合中间量state实现可控
    */

//******************************全局部分******************************//
int led=13;
int key=11;
int state;

//******************************初始化******************************//
void setup()
{
  pinMode(led,OUTPUT);
  pinMode(key,INPUT_PULLUP);
}

//******************************内层函数******************************//
void liang()
{
  digitalWrite(led,HIGH);
}

void mie()
{
  digitalWrite(led,LOW);
}

//******************************主函数******************************//
void loop()
{
  state=digitalRead(key);

  if(state==0)
  {
    liang();
  }

  else
  {
    mie();
  }
}