//led亮灭程序

//******************************逻辑******************************//
  /*数字信号输出对应1/0
  /*输出信号后，如果不给延时与改变，则长亮
  */

//******************************全局部分******************************//
int led=13;

//******************************初始化******************************//
void setup()
{
  pinMode(led,OUTPUT);
}

//******************************内层函数******************************//     这一段其实直接简化就好，没必要单独写两个函数，只是方便后续copy
void liang()
{
  digitalWrite(led,HIGH);
}

void mie()
{
  digitalWrite(led,LOW);
}

//******************************主函数******************************//        数字信号输出 0/1    亮度固定
void loop()
{
  liang();
  delay(3000);
  mie();
  delay(3000);
}





// //led亮灭程序——重制版

// //*****************************************全局部分****************************//
// int led=13;
// int ledstate=0;
// //****************************************初始化*******************************//
// void setup()
// {
//   pinMode(led,OUTPUT);
// }

// //***************************************主程序******************************//
// void loop()
// {
//   ledstate=!ledstaet;
//  digitalWrite(led,ledstate);
//  delay(3000);
// }
